var map = L.map('map').setView([37.5, 126.5], 7);

L.tileLayer('https://tiles.osm.kr/hot/{z}/{x}/{y}.png', {
    maxZoom: 19,
    attribution: '&copy; <a href="https://openstreetmap.org/copyright">OpenStreetMap</a>'
}).addTo(map);

// 적는 법 {latling: [위도, 경도], popupContent: '이름'}
// http://map.esran.com/
var markers = [
    //서울 및 경기도
    {latlng: [37.59507908239112, 127.02286181376326], popupContent: '서울특별시 성북구 - 성북다문화음식축제'},
    {latlng: [37.51746390694027, 127.11857945016345], popupContent: '서울특별시 송파구 - 한성백제문화제'},
    {latlng: [37.614793025380756, 126.7224940168535], popupContent: '경기도 김포시 - 김포 쌀'},
    {latlng: [37.45559292997296, 126.70282970505994], popupContent: '인천광역시 - 인천 펜타포트 축제'},
    {latlng: [37.747778939981785, 126.48671734440585], popupContent: '경기도 강화군 - 강화 약쑥'},
    {latlng: [37.29912915179103, 127.63750911828814], popupContent: '경기도 여주시 - 여주 쌀, 여주오곡나루축제'},
    {latlng: [37.264815775824054, 127.44962769343665], popupContent: '경기도 이천시 - 이천 쌀, 이천쌀문화축제'},
    //강원도
    {latlng: [38.14922900606689, 127.30824507652176], popupContent: '강원도 철원군 - 철원 쌀'},
    {latlng: [38.1065896551385, 127.703568780381], popupContent: '강원도 화천군 - 화천산천어축제'},
    {latlng: [38.383102618386296, 128.473852023994], popupContent: '강원도 고성군 - 강원고성명태축제'},
    {latlng: [38.07799362689874, 128.61503876832498], popupContent: '강원도 양양군 - 양양 송이'},
    {latlng: [37.864151031968106, 127.74780502880344], popupContent: '강원도 춘천시 - 춘천국제마임축제'},
    {latlng: [37.69599354834061, 127.8839873934837], popupContent: '강원도 홍천군 - 홍천 찰옥수수'},
    {latlng: [37.49454907781831, 127.98292485378869], popupContent: '강원도 횡성군 - 횡성 한우고기'},
    {latlng: [37.371659526740444, 128.39169745562444], popupContent: '강원도 평창군 - 평창효석문화제'},
    {latlng: [37.494708570817366, 128.53581544531434], popupContent: '강원도 평창군 진부면 - 진부 당귀'},
    {latlng: [37.38577266182911, 128.6607677359983], popupContent: '강원도 정선군 - 정선 찰옥수수, 정선 황기'},
    //충청북도
    {latlng: [36.990141267330905, 127.92751136567914], popupContent: '충청북도 충주시 - 충주 사과, 충주세계무술축제'},
    {latlng: [36.81935531575413, 127.77911890056025], popupContent: '충청북도 괴산군 - 괴산 고추, 괴산 고춧가루, 괴산고추축제'},
    {latlng: [36.35124984699738, 127.38513913863056], popupContent: '대전광역시 - 대전효문화뿌리축제'},
    //충청남도
    {latlng: [36.78531853080354, 126.45126510216434], popupContent: '충청남도 서산시 - 서산 마늘'},
    {latlng: [36.600263019461494, 127.09740099762485], popupContent: '충청남도 공주시 정안면 - 정안 밤'},
    {latlng: [6.71181416556663, 126.56192013216504], popupContent: '충청남도 서산시 해미면 - 해미읍성역사체험축제'},
    {latlng: [36.990141267330905, 127.92751136567914], popupContent: '충청남도 홍성군 - 홍성역사인물축제'},
    {latlng: [36.458837666704255, 126.80199367460493], popupContent: '충청남도 청양군 - 청양 구기자'},
    {latlng: [36.27843961737076, 126.90431371313942], popupContent: '충청남도 부여군 - 부여서동연꽃축제'},
    {latlng: [36.08715067230901, 126.82531392990026], popupContent: '충청남도 서천군 한산면 - 한산 모시, 한산모시문화제'},
    {latlng: [36.08715067230901, 126.82531392990026], popupContent: '충청남도 논산시 - 강경젓갈축제'},
    {latlng: [36.10950497944233, 127.48666577275863], popupContent: '충청남도 금산군 - 금강여울축제'},
    //전라북도
    {latlng: [35.906491958099494, 127.15999770464178], popupContent: '전라북도 완주군 - 완주와일드푸드축제'},
    {latlng: [36.010339886832824, 127.6592715249141], popupContent: '전라북도 무주군 - 무주반딧불축제'},
    {latlng: [35.80502250712423, 127.11872528351711], popupContent: '전라북도 전주시 - 전주세계소리, 전주한지문화축제'},
    {latlng: [35.80372401158475, 126.88059070671798], popupContent: '전라북도 김제시 - 김제지평선축제'},
    {latlng: [35.37598684135882, 127.13706595965517], popupContent: '전라북도 순창군 - 순창 전통 고추장, 순창장류축제'},
    {latlng: [35.41688658419501, 127.4144213716986], popupContent: '전라북도 남원시 - 남원춘향제'},
    {latlng: [35.43568895876807, 126.70202128271984], popupContent: '전라북도 고창군 - 고창 복분자'},
    //전라남도
    {latlng: [35.16040808488448, 126.85135500883767], popupContent: '광주광역시 - 광주비엔날레, 광주추억의7080충장축제, 광산우리밀축제'},
    {latlng: [35.32079436615459, 126.98830974822476], popupContent: '전라남도 담양군 - 담양대나무축제'},
    {latlng: [35.06760960513017, 127.750247395932], popupContent: '전라남도 하동군 - 하동 녹차'},
    {latlng: [35.06593734418963, 126.5164076191232], popupContent: '전라남도 함평군 - 함평나비축제'},
    {latlng: [34.9910884141714, 126.48162344268312], popupContent: '전라남도 무안군 - 무안 양파, 무안 백련차'},
    {latlng: [34.79999848314309, 126.69630603281432], popupContent: '전라남도 영암군 - 영암왕인문화축제'},
    {latlng: [34.8122705208567, 126.39181462799601], popupContent: '전라남도 목포시 - 목포해양문화축제'},
    {latlng: [34.57356614213224, 126.59843940073584], popupContent: '전라남도 해남군 - 해남 겨울배추, 해남 고구마'},
    {latlng: [34.486907211593554, 126.26302527753849], popupContent: '전라남도 진도군 - 진도 홍주, 진도신비의바닷길축제'},  
    {latlng: [34.64251270573542, 126.76651197743325], popupContent: '전라남도 강진군 - 강진청자축제'},
    {latlng: [34.68178646239342, 126.90642750874362], popupContent: '전라남도 장흥군 - 장흥 표고버섯, 정남진장흥물축제'},
    {latlng: [34.771505776989706, 127.08006229449947], popupContent: '전라남도 보성군 - 보성 녹차. 보성다향제, 녹차대축제'},
    {latlng: [34.60536088030426, 127.27422362455442], popupContent: '전라남도 고흥군 - 고흥 유자'},  
    {latlng: [34.9407339959868, 127.69584800116277], popupContent: '전라남도 광양시 - 광양 매실'},  
    //경상북도
    {latlng: [35.892225917226824, 128.60001268781417], popupContent: '대구광역시 - 대구약령시한방문화축제'},
    {latlng: [35.72509661732635, 128.26228587642365], popupContent: '경상북도 고령군 - 고령대가야체험축제'},
    {latlng: [35.85560037509008, 129.2249747306832], popupContent: '경상북도 경주시 - 경주신라소리축제'},
    {latlng: [35.82519616221083, 128.7414939186277], popupContent: '경상북도 경산시 - 경산 대추'},
    {latlng: [35.91949959638629, 128.2828725125526], popupContent: '경상북도 성주군 - 성주 참외'},
    {latlng: [36.41214557690807, 128.15839374304176], popupContent: '경상북도 상주시 - 상주 곶감'},
    {latlng: [36.3538211662764, 128.69580739716676], popupContent: '경상북도 의성군 - 의성 마늘'},
    {latlng: [36.01881505022369, 129.3430816012837], popupContent: '경상북도 포항시 - 포항불빛축제'},
    {latlng: [36.43564813265739, 129.0572670566321], popupContent: '경상북도 청송군 - 청송 사과'},  
    {latlng: [36.66705313013096, 129.11297835530578], popupContent: '경상북도 영양군 - 영양 고춧가루'},
    {latlng: [36.56815797989385, 128.72872052626414], popupContent: '경상북도 안동시 - 안동 포'},
    {latlng: [36.586904209276874, 128.18602905438965], popupContent: '경상북도 문경시 - 문경찻사발축제'},
    {latlng: [36.89347748480042, 128.73226205645145], popupContent: '경상북도 봉화군 - 봉화 송이, 봉화은어축제'},  
    //경상남도
    {latlng: [5.41563059269592, 127.87320353732942], popupContent: '경상남도 산청군 - 산청 곶감, 산청한방약초축제'},
    {latlng: [35.54481450065033, 128.49282675102233], popupContent: '경상남도 창녕군 - 창녕 양파'},
    {latlng: [35.504213617496774, 128.74599676974105], popupContent: '경상남도 밀양시 - 밀양 얼음골 사과'},
    {latlng: [34.83863932163241, 127.89260421934151], popupContent: '경상남도 남해군 - 남해 마늘'},  
    {latlng: [34.87016551781373, 127.99303617743456], popupContent: '경상남도 남해군 창선면 - 남해 창선 고사리'},
    {latlng: [34.7789044181427, 128.48588567715174], popupContent: '경상남도 통영시 - 통영한산대첩축제'},
    {latlng: [35.21386943637387, 128.61746705828986], popupContent: '경상남도 창원시 - 창원가고파국화축제'},
    {latlng: [35.21077364715182, 129.09023051334773], popupContent: '부산광역시 - 동래읍성역사축제'},  
    //제주도
    {latlng: [33.37536482196444, 126.53622496689063], popupContent: '제주도 - 제주 돼지고기, 제주들불축제, 도두오래물축제'},
    //울릉도
    {latlng: [37.5073816641187, 130.83973373486492], popupContent: '울릉도 - 삼나물, 미역취, 참고비, 부지갱이'}
];

markers.forEach(function(markerInfo) {
    var marker = L.marker(markerInfo.latlng).addTo(map);
    marker.bindPopup(markerInfo.popupContent);
});

map.on('click', function (e) {
    updateInfoPanel(e.latlng);
});

function updateInfoPanel(latlng) {
    // 클릭한 위치의 위도와 경도 업데이트
    document.getElementById('latitude').textContent = latlng.lat.toFixed(6);
    document.getElementById('longitude').textContent = latlng.lng.toFixed(6);

    // 클릭한 위치의 주소를 지오코딩을 통해 가져오기 (OpenCage Geocoder 사용)
    fetch('https://api.opencagedata.com/geocode/v1/json?q=' + latlng.lat + '+' + latlng.lng + '&key=YOUR_OPENCAGE_API_KEY')
        .then(response => response.json())
        .then(data => {
            const address = data.results[0].formatted;
            document.getElementById('address').textContent = address;
        })
        .catch(error => {
            console.error('Error fetching address:', error);
        });
}
